// Расписание на сентябрь 2025
const september2025 = {
    "2025-09-04": [
        {
            time: "09:00 - 11:50",
            subject: "Управление данными",
            teacher: "Жуков А.В.",
            room: "-",
            type: "lecture"
        },
        {
            time: "12:30 - 15:20",
            subject: "Информационные технологии",
            teacher: "Батманова О.В.",
            room: "-",
            type: "lecture"
        }
    ],
    "2025-09-08": [
        {
            time: "12:30 - 15:20",
            subject: "Теория информации",
            teacher: "Шарапова Л.В.",
            room: "-",
            type: "lecture"
        },
        {
            time: "15:30 - 18:20",
            subject: "Технология программирования",
            teacher: "Маслянкин В.И.",
            room: "-",
            type: "lecture"
        }
    ],
    "2025-09-09": [
        {
            time: "09:00 - 11:50",
            subject: "Вероятность и статистика",
            teacher: "Шаймарданова Л.К.",
            room: "-",
            type: "lecture"
        }
    ],
    "2025-09-11": [
        {
            time: "09:00 - 11:50",
            subject: "Управление данными",
            teacher: "Жуков А.В.",
            room: "-",
            type: "practice"
        },
        {
            time: "12:30 - 15:20",
            subject: "Управление информационными ресурсами и проектами",
            teacher: "Былова Н.В.",
            room: "-",
            type: "lecture"
        },
    ],
    "2025-09-12": [
        {
            time: "09:00 - 11:50",
            subject: "Деловой иностранный язык",
            teacher: "Иванова О.В.",
            room: "-",
            type: "practice"
        },
        {
            time: "12:30 - 15:20",
            subject: "Вычислительная математика",
            teacher: "Шарапова Л.В.",
            room: "-",
            type: "lecture"
        },
    ],
    "2025-09-15": [
        {
            time: "09:00 - 11:50",
            subject: "Теория информации",
            teacher: "Иванова О.В.",
            room: "-",
            type: "lecture"
        },
        {
            time: "12:30 - 15:20",
            subject: "Дифференциальные уравнения",
            teacher: "Толмачев А.И.",
            room: "-",
            type: "lecture"
        },
    ],
    "2025-09-16": [
        {
            time: "09:00 - 11:50",
            subject: "Вероятность и статистика",
            teacher: "Шаймарданова Л.К.",
            room: "-",
            type: "seminar"
        },
        {
            time: "12:30 - 15:20",
            subject: "Технологии программирования",
            teacher: "Маслянкин В.И.",
            room: "-",
            type: "lecture"
        },
    ],
    "2025-09-18": [
        {
            time: "09:00 - 11:50",
            subject: "Управление данными",
            teacher: "Жуков А.В.",
            room: "-",
            type: "practice"
        }
    ],
    "2025-09-19": [
        {
            time: "09:00 - 11:50",
            subject: "Деловой иностранный язык",
            teacher: "Иванова О.В.",
            room: "-",
            type: "practice"
        }
    ],
    "2025-09-22": [
        {
            time: "15:30 - 18:20",
            subject: "Технологии программирования",
            teacher: "Маслянкин В.И.",
            room: "-",
            type: "practice"
        }
    ],
    "2025-09-23": [
        {
            time: "12:30 - 15:20",
            subject: "Информационные технологии",
            teacher: "Батманова О.В.",
            room: "-",
            type: "practice"
        }
    ],
    "2025-09-24": [
        {
            time: "12:30 - 15:20",
            subject: "Вероятность и статистика",
            teacher: "Шаймарданова Л.К.",
            room: "-",
            type: "lecture"
        }
    ],
    "2025-09-25": [
        {
            time: "09:00 - 11:50",
            subject: "Управление данными",
            teacher: "Жуков А.В.",
            room: "-",
            type: "lecture"
        },
        {
            time: "12:30 - 15:20",
            subject: "Управление информационными ресурсами и проектами",
            teacher: "Былова Н.В.",
            room: "-",
            type: "seminar"
        },
    ],
    "2025-09-26": [
        {
            time: "12:30 - 15:20",
            subject: "Вычислительная математика",
            teacher: "Шарапова Л.В.",
            room: "-",
            type: "seminar"
        }
    ],
    "2025-09-29": [
        {
            time: "12:30 - 15:20",
            subject: "Теория информации",
            teacher: "Шарапова Л.В.",
            room: "-",
            type: "seminar"
        },
        {
            time: "15:30 - 18:20",
            subject: "Технологии программирования",
            teacher: "Маслянкин В.И.",
            room: "-",
            type: "lecture"
        },
    ],
    "2025-09-30": [
        {
            time: "09:00 - 11:50",
            subject: "Информационные технологии",
            teacher: "Батманова О.В.",
            room: "-",
            type: "lecture"
        }
    ],
};
