const october2025 = {
    "2025-10-01": [
        {
            time: "12:30 - 15:20",
            subject: "Теория информации",
            teacher: "Шарапова Л.В.",
            room: "-",
            type: "lecture"
        }
    ],
    "2025-10-03": [
        {
            time: "09:00 - 11:50",
            subject: "Деловой иностранный язык",
            teacher: "Иванова О.В.",
            room: "-",
            type: "practice"
        },
        {
            time: "12:30 - 15:20",
            subject: "Вычислительная математика",
            teacher: "Шарапова Л.В.",
            room: "-",
            type: "seminar"
        },
    ],
    "2025-10-06": [
        {
            time: "14:00 - 15:20",
            subject: "Теория информации",
            teacher: "Шарапова Л.В.",
            room: "-",
            type: "seminar"
        },
        {
            time: "15:30 - 18:20",
            subject: "Технологии программирования",
            teacher: "Маслянкин В.И.",
            room: "-",
            type: "practice"
        },
    ],
    "2025-10-08": [
        {
            time: "09:00 - 11:50",
            subject: "Вероятность и статистика",
            teacher: "Шаймарданова Л.К.",
            room: "-",
            type: "seminar"
        },
        {
            time: "12:30 - 15:20",
            subject: "Дифференциальные уравнения",
            teacher: "Толмачев А.И.",
            room: "-",
            type: "seminar"
        },
    ],
    "2025-10-09": [
        {
            time: "09:00 - 11:50",
            subject: "Управление данными",
            teacher: "Жуков А.В.",
            room: "-",
            type: "practice"
        },
        {
            time: "12:30 - 15:20",
            subject: "Управление информационными ресурсами и проектами",
            teacher: "Былова Н.В.",
            room: "-",
            type: "lecture"
        },
    ],
    "2025-10-10": [
        {
            time: "09:00 - 11:50",
            subject: "Деловой иностранный язык",
            teacher: "Иванова О.В.",
            room: "-",
            type: "practice"
        },
    ],
    "2025-10-13": [
        {
            time: "09:00 - 11:50",
            subject: "Теория информации",
            teacher: "Шарапова Л.В.",
            room: "-",
            type: "lecture"
        },
        {
            time: "12:30 - 15:20",
            subject: "Дифференциальные уравнения",
            teacher: "Толмачев А.И.",
            room: "-",
            type: "lecture"
        },
    ],
    "2025-10-14": [
        {
            time: "09:00 - 11:50",
            subject: "Вероятность и статистика",
            teacher: "Шаймарданова Л.К.",
            room: "-",
            type: "lecture"
        },
        {
            time: "12:30 - 15:20",
            subject: "Информационные технологии",
            teacher: "Батманова О.В.",
            room: "-",
            type: "practice"
        },
    ],
    "2025-10-16": [
        {
            time: "09:00 - 11:50",
            subject: "Управление данными",
            teacher: "Жуков А.В.",
            room: "-",
            type: "lecture"
        },
        {
            time: "12:30 - 15:20",
            subject: "Управление информационными ресурсами и проектами",
            teacher: "Былова Н.В.",
            room: "-",
            type: "seminar"
        },
    ],
    "2025-10-17": [
        {
            time: "09:00 - 11:50",
            subject: "Деловой иностранный язык",
            teacher: "Иванова О.В.",
            room: "-",
            type: "practice"
        },
        {
            time: "12:30 - 15:20",
            subject: "Вычислительная математика",
            teacher: "Шарапова Л.В.",
            room: "-",
            type: "lecture"
        },
    ],
    "2025-10-20": [
        {
            time: "12:30 - 15:20",
            subject: "Теория информации",
            teacher: "Шарапова Л.В.",
            room: "-",
            type: "seminar"
        },
        {
            time: "15:30 - 18:20",
            subject: "Технологии программирования",
            teacher: "Маслянкин В.И.",
            room: "-",
            type: "lecture"
        },
    ],
    "2025-10-21": [
        {
            time: "09:00 - 11:50",
            subject: "Вероятность и статистика",
            teacher: "Шаймарданова Л.К.",
            room: "-",
            type: "seminar"
        },
    ],
    "2025-10-23": [
        {
            time: "09:00 - 11:50",
            subject: "Информационные технологии",
            teacher: "Батманова О.В.",
            room: "-",
            type: "lecture"
        },
        {
            time: "12:30 - 15:20",
            subject: "Управление информационными ресурсами и проектами",
            teacher: "Былова Н.В.",
            room: "-",
            type: "lecture"
        },
    ],
    "2025-10-24": [
        {
            time: "09:00 - 11:50",
            subject: "Деловой иностранный язык",
            teacher: "Иванова О.В.",
            room: "-",
            type: "practice"
        },
        {
            time: "12:30 - 15:20",
            subject: "Вычислительная математика",
            teacher: "Шарапова Л.В.",
            room: "-",
            type: "seminar"
        },
    ],
    "2025-10-27": [
        {
            time: "09:00 - 11:50",
            subject: "Теория информации",
            teacher: "Шарапова Л.В.",
            room: "-",
            type: "lecture"
        },
        {
            time: "12:30 - 15:20",
            subject: "Дифференциальные уравнения",
            teacher: "Толмачев А.И.",
            room: "-",
            type: "seminar"
        },
    ],
    "2025-10-28": [
        {
            time: "12:30 - 15:20",
            subject: "Вероятность и статистика",
            teacher: "Шаймарданова Л.К.",
            room: "-",
            type: "lecture"
        },
    ],
    "2025-10-30": [
        {
            time: "09:00 - 11:50",
            subject: "Управление данными",
            teacher: "Жуков А.В.",
            room: "-",
            type: "practice"
        },
        {
            time: "12:30 - 15:20",
            subject: "Управление информационными ресурсами и проектами",
            teacher: "Былова Н.В.",
            room: "-",
            type: "seminar"
        },
    ],
    "2025-10-31": [
        {
            time: "09:00 - 11:50",
            subject: "Деловой иностранный язык",
            teacher: "Иванова О.В.",
            room: "-",
            type: "practice"
        },
    ],
};
