// Расписание на сентябрь 2025
const septemberSchedule = {
    '2025-09-04': [
        {
            type: 'лекция',
            subject: 'УПРАВЛЕНИЕ ДАННЫМИ',
            teacher: 'Жуков А.В.',
            time: '09:00-11:50'
        },
        {
            type: 'практика',
            subject: 'ИНФОРМАЦИОННЫЕ ТЕХНОЛОГИИ',
            teacher: 'Батманова О.В.',
            time: '12:30-15:20'
        }
    ],
    '2025-09-08': [
        {
            type: 'лекция',
            subject: 'ТЕХНОЛОГИИ ПРОГРАММИРОВАНИЯ',
            teacher: 'Маслянкин В.И.',
            time: '09:00-11:50'
        },
        {
            type: 'лекция',
            subject: 'ТЕОРИЯ ИНФОРМАЦИИ',
            teacher: 'Шарапова Л.В.',
            time: '12:30-15:20'
        }
    ],
    '2025-09-09': [
        {
            type: 'лекция',
            subject: 'ВЕРОЯТНОСТЬ И СТАТИСТИКА',
            teacher: 'Шаймарданова Л.К.',
            time: '09:00-11:50'
        }
    ],
    '2025-09-11': [
        {
            type: 'практика',
            subject: 'УПРАВЛЕНИЕ ДАННЫМИ',
            teacher: 'Жуков А.В.',
            time: '09:00-11:50'
        },
        {
            type: 'лекция',
            subject: 'УПРАВЛЕНИЕ ИНФ. РЕС. И ПРОЕКТАМИ',
            teacher: 'Былова Н.В.',
            time: '12:30-15:20'
        }
    ],
    '2025-09-12': [
        {
            type: 'практика',
            subject: 'ДЕЛОВОЙ ИНОСТРАННЫЙ ЯЗЫК',
            teacher: 'Иванова О.В.',
            time: '09:00-11:50'
        },
        {
            type: 'лекция',
            subject: 'ВЫЧИСЛИТЕЛЬНАЯ МАТЕМАТИКА',
            teacher: 'Шарапова Л.В.',
            time: '12:30-15:20'
        }
    ],
    '2025-09-15': [
        {
            type: 'лекция',
            subject: 'ТЕОРИЯ ИНФОРМАЦИИ',
            teacher: 'Шарапова Л.В.',
            time: '09:00-11:50'
        },
        {
            type: 'лекция',
            subject: 'ДИФФЕРЕНЦИАЛЬНЫЕ УРАВНЕНИЯ',
            teacher: 'Толмачев А.И.',
            time: '12:30-15:20'
        }
    ],
    '2025-09-16': [
        {
            type: 'семинар',
            subject: 'ВЕРОЯТНОСТЬ И СТАТИСТИКА',
            teacher: 'Шаймарданова Л.К.',
            time: '09:00-11:50'
        },
        {
            type: 'лекция',
            subject: 'ТЕХНОЛОГИИ ПРОГРАММИРОВАНИЯ',
            teacher: 'Толмачев А.И.',
            time: '12:30-15:20'
        }
    ],
    '2025-09-18': [
        {
            type: 'практика',
            subject: 'УПРАВЛЕНИЕ ДАННЫМИ',
            teacher: 'Жуков А.В.',
            time: '09:00-11:50'
        }
    ],
    '2025-09-19': [
        {
            type: 'практика',
            subject: 'ДЕЛОВОЙ ИНОСТРАННЫЙ ЯЗЫК',
            teacher: 'Иванова О.В.',
            time: '09:00-11:50'
        }
    ],
    '2025-09-22': [
        {
            type: 'практика',
            subject: 'ТЕХНОЛОГИИ ПРОГРАММИРОВАНИЯ',
            teacher: 'Маслянкин В.И.',
            time: '15:30-18:20'
        }
    ],
    '2025-09-23': [
        {
            type: 'практика',
            subject: 'ИНФОРМАЦИОННЫЕ ТЕХНОЛОГИИ',
            teacher: 'Батманова О.В.',
            time: '12:30-15:20'
        }
    ],
    '2025-09-24': [
        {
            type: 'лекция',
            subject: 'ВЕРОЯТНОСТЬ И СТАТИСТИКА',
            teacher: 'Шаймарданова Л.К.',
            time: '12:30-15:20'
        }
    ],
    '2025-09-25': [
        {
            type: 'лекция',
            subject: 'УПРАВЛЕНИЕ ДАННЫМИ',
            teacher: 'Жуков А.В.',
            time: '09:00-11:50'
        },
        {
            type: 'семинар',
            subject: 'УПРАВЛЕНИЕ ИНФ. РЕС. И ПРОЕКТАМИ',
            teacher: 'Толмачев А.И.',
            time: '12:30-15:20'
        }
    ],
    '2025-09-26': [
        {
            type: 'семинар',
            subject: 'ВЫЧИСЛИТЕЛЬНАЯ МАТЕМАТИКА',
            teacher: 'Шарапова Л.В.',
            time: '12:30-15:20'
        }
    ],
    '2025-09-29': [
        {
            type: 'семинар',
            subject: 'ТЕОРИЯ ИНФОРМАЦИИ',
            teacher: 'Шарапова Л.В.',
            time: '12:30-15:20'
        },
        {
            type: 'лекция',
            subject: 'ТЕХНОЛОГИИ ПРОГРАММИРОВАНИЯ',
            teacher: 'Маслянкин В.И.',
            time: '15:30-18:20'
        }
    ],
    '2025-09-30': [
        {
            type: 'лекция',
            subject: 'ИНФОРМАЦИОННЫЕ ТЕХНОЛОГИИ',
            teacher: 'Батманова О.В.',
            time: '09:00-11:50'
        }
    ],
};

window.septemberSchedule = septemberSchedule;
